#+TITLE: PPL -- Syllabus
#+SETUPFILE: ../general-setup.org
#+OPTIONS: H:3 num:2

* Course Information

** Course Description

   This course deals with

   1. programming language principles that support procedure
      abstraction, data abstraction, storage allocation and parallel
      execution.
   2. language translation, i.e., compiler techniques.


   - Course Number :: COMP 3220
   - Course Title :: Principle of Programming Languages
   - Total Credit :: 3
   - Prerequisites :: COMP 2210
   - Class Meeting :: 3 hours per week


** Instructor Information

   - Instructor :: Zhitao Gong
     + Office :: Shelby 2307
     + Office Hours :: Friday Morning
     + Email :: zzg0009@auburn.edu

   - Teaching Assistant :: Wenlu Wang
     + Office :: Shelby 2307
     + Office Hours :: Friday Morning
     + Email :: wzw0022@auburn.edu


** Textbook and Course Materials

*** Required Textbook

    /Concepts of Programming Languages/, tenth edition by Robert
    W. Sebesta.

*** Recommended Texts

    - /Essentials of Programming Languages/, Third edition by Daniel
      P. Friedman and Mitchell Wand.
    - /Modern Programming Languages: A Practical Introduction/, Second
      Edition by Dr. Adam Brooks Webber[fn:1].
    - /Formal Language: A Practical Introduction/ by Adam Brooks Webber[fn:2].

** Course Structure

   Two lectures are delivered each week.  The following topics are
   covered with studying hourse specified.

   #+CAPTION: Topics covered in COMP3220
   #+NAME: tab:comp3220-topics
   | Topics                                    | Hour |
   |-------------------------------------------+------|
   | Introduction                              |    2 |
   | Programming Tutorials, =C++= and =Python= |    3 |
   | Syntax and Semantics                      |    6 |
   | Parser                                    |    2 |
   | Variables                                 |  1.5 |
   | Data Types                                |  1.5 |
   | Polymorphism                              |  1.5 |
   | Control Structure                         |    3 |
   | Procedure Abstraction                     |    3 |
   | Object Oriendted Programming              |    3 |
   | Storage Abstract                          |    3 |
   | Exams                                     |    3 |
   |-------------------------------------------+------|
   | Total Hours                               | 32.5 |
   #+TBLFM: @14$2=vsum(@I..@II)


* Student Learning Outcomes

  1. Get an understanding of the basic structure of programming
     languages, e.g., variables, control structures, abstraction, etc.
  2. Study Different language paradigms, e.g., functional, imperative,
     interpreted, logic, etc.

* Schedule

* Grading Policy

** Graded Course Activities

   All assignments details are posted on [[https://auburn.instructure.com/][Canvas]].

   #+CAPTION: Grade weight distribution
   #+NAME: tab:grade-weight
   | Description  | Points |
   |--------------+--------|
   | Assignment   |     40 |
   | Midterm Exam |     20 |
   | Final Exam   |     20 |
   | Term Project |     20 |
   |--------------+--------|
   | Total        |    100 |
   #+TBLFM: @6$2=vsum(@I..@II)

*** Late Work Policy

    Be sure to subscribe to Canvas notifications and pay close
    attention to deadlines.  There will be *NO* make up assignments or
    quizzes, or late work accepted without a serious and compelling
    reason and instructor approval.

** Letter Grade Assignment

   Final grades assigned for this course will be based on the
   percentage of total points earned and are assigned as shown in
   Table [[tab:letter-grade]].  Note that your grade will be automatically
   /rounded up/.

   #+CAPTION: Letter Grade
   #+NAME: tab:letter-grade
   | Letter Grade | Percentage  |
   |--------------+-------------|
   | A            | 90% -- 100% |
   | B            | 80% -- 89%  |
   | C            | 70% -- 79%  |
   | D            | 60% -- 69%  |
   | F            | 00% -- 59%  |

* Course Policy

 #  LocalWords:  PPL SETUPFILE num Zhitao Wenlu th Sebesta

* Footnotes

[fn:1] Available online: http://www.webber-labs.com/mpl/.

[fn:2] Available online: http://www.webber-labs.com/fl/
